Tekla Open API Reference for Tekla Structures 2025
AnalysisEdge Methods
The AnalysisEdge type exposes the following members.
Methods
Name | Description
AddSplit
 Adds a split position to the analysis edge.
CopyData
 Copies data from another analysis edge.
GetSplitPositions
 Gets the split positions of the analysis edge.
Modify
 Modifies an analysis edge. The AnalysisModelName has to be set.
Select
 Selects an analysis edge.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisEdge Class
Tekla.Structures.Analysis Namespace